print(273)
print(52.273)
print(type(52)) #정수
print(type(52.273)) #부동 소수점(실수)
print(0)
print(0.0)
print(type(0))
print(type(0.0))
#사칙 연산자
print()
print("5+7=", 5+7)
print("5-7=", 5-7)
print("5*7=", 5*7)
print("5/7=", 5/7)
print()
print("3/2=", 3/2)
print("3//2=", 3//2) #정수 나누기 연산자 //
print("5%2=", 5%2) #나머지 연산자 %
print("2**2=", 2**2) # 제곱 연산자 
print(2+2-2*2/2*2)
print(2-2+2/2*2+2) #연산자 우선순위, 같은 레벨의 우선순위일 때는 왼쪽에서 오른쪽 순서로 
print("안녕"+"하세요"*3)
print(("안녕"+"하세요")*3)
print("안녕"+("하세요"*3))
print()
print("확인문제")
print("#기본적인 연산")
print(15,"+", 4, "=", 15+4)
print(15,"-", 4, "=", 15-4)
print(15,"*", 4, "=", 15*4)
print(15,"/", 4, "=", 15/4)
print("#3462를 17로 나누었을 때의")
print("- 몫:", 3462//17) #몫이니까 정수만 보여야 하므로 정수 나누기 연산자 //
print("- 나머지:", 3462%17)
print("#다음 식 연산")
print(2+2-2*2/2*2)
print(2-2+2/2*2+2)